In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sbn

In [6]:
dataFrame = pd.read_excel("merc.xlsx")

In [7]:
dataFrame.head()

   year  price transmission  mileage  tax   mpg  engineSize
0  2005   5200    Automatic    63000  325  32.1         1.8
1  2017  34948    Automatic    27000   20  61.4         2.1
2  2016  49948    Automatic     6200  555  28.0         5.5
3  2016  61948    Automatic    16000  325  30.4         4.0
4  2016  73948    Automatic     4000  325  30.1         4.0

mpg = How much fuel does it use in 1 mile?

In [9]:
dataFrame["transmission"].unique()

array(['Automatic', 'Manual', 'Semi-Auto', 'Other'], dtype=object)

In [10]:
transmission = {"Other": 0, "Manual": 1, "Semi-Auto": 2, "Automatic": 3}

In [13]:
dataFrame["transmission"] = dataFrame["transmission"].map(transmission)

In [14]:
dataFrame.head()

   year  price  transmission  mileage  tax   mpg  engineSize
0  2005   5200             3    63000  325  32.1         1.8
1  2017  34948             3    27000   20  61.4         2.1
2  2016  49948             3     6200  555  28.0         5.5
3  2016  61948             3    16000  325  30.4         4.0
4  2016  73948             3     4000  325  30.1         4.0

In [17]:
dataFrame.describe()

,year,price,transmission,mileage,tax,mpg,engineSize
count,13119.000000,13119.000000,13119.000000,13119.000000,13119.000000,13119.000000,13119.000000
mean,2017.296288,24698.596920,2.257413,21949.559037,129.972178,55.155843,2.071530
std,2.224709,11842.675542,0.642056,21176.512267,65.260286,15.220082,0.572426
min,1970.000000,650.000000,0.000000,1.000000,0.000000,1.100000,0.000000
25%,2016.000000,17450.000000,2.000000,6097.500000,125.000000,45.600000,1.800000
50%,2018.000000,22480.000000,2.000000,15189.000000,145.000000,56.500000,2.000000
75%,2019.000000,28980.000000,3.000000,31779.500000,145.000000,64.200000,2.100000
max,2020.000000,159999.000000,3.000000,259000.000000,580.000000,217.300000,6.200000